# coding: utf-8
from pygame.locals import *
import pygame

import obj_base

#-------------------------------------------------------------------------------
# 移動マネージャークラス
#-------------------------------------------------------------------------------
class ObjectPartyPlayer( obj_base.ObjectBase ):

    #-------------------------------------------------------------------------------
    # 進行方向を取得する
    #-------------------------------------------------------------------------------
    def get_direction( self, cursor ):
        # 移動オフセットの進捗更新
        return cursor.get_direction()
