# coding: utf-8
from pygame.locals import *
import pygame

import obj_base

#-------------------------------------------------------------------------------
# 移動マネージャークラス
#-------------------------------------------------------------------------------
class ObjectPartyPlayer( obj_base.ObjectBase ):

    #-------------------------------------------------------------------------------
    # コンストラクタ
    #-------------------------------------------------------------------------------
    def __init__( self, pygame, pos, grid_wh, acnt, tcnt ):

        self.type       = "PLAYER"
        self.init_common( pygame, pos, grid_wh, acnt, tcnt )

        return
    #-------------------------------------------------------------------------------
    # 進行方向を取得する
    #-------------------------------------------------------------------------------
    def get_direction( self, cursor ):
        # 移動オフセットの進捗更新
        return cursor.get_direction()
