# coding: utf-8
from pygame.locals import *
import pygame
import sys
import time
import threading

import scn_base

#-------------------------------------------------------------------------------
# シーンクラス
#-------------------------------------------------------------------------------
class SceneBattle( scn_base.SceneBase ):

    #-------------------------------------------------------------------------------
    # メンバ（Private）
    #-------------------------------------------------------------------------------
    __pygame = None
    __screen = None
    __scene  = None
    __image  = None

    #-------------------------------------------------------------------------------
    # コンストラクタ
    #-------------------------------------------------------------------------------
    def __init__( self, pygame, screen ):

        self.__pygame = pygame
        self.__screen = screen
        self.__scene  = scn_base.EnumScene.Battle

        # 画像ファイルを読み込み
        self.__image = self.__pygame.image.load( "image/battle.png" ).convert()

        return
    #-------------------------------------------------------------------------------
    # 周期処理開始
    #-------------------------------------------------------------------------------
    def start( self ):
        self.__scene  = scn_base.EnumScene.Battle
        return

    #-------------------------------------------------------------------------------
    # 終了処理
    #-------------------------------------------------------------------------------
    def __finalize( self ):
        self.__pygame.quit() 
        sys.exit()

    #-------------------------------------------------------------------------------
    # 周期更新
    #-------------------------------------------------------------------------------
    def __update( self ):
        pass
        return

    #-------------------------------------------------------------------------------
    # 描画
    #-------------------------------------------------------------------------------
    def draw( self ):

        # 画像を描画
        self.__screen.blit( self.__image, ( 0, 0 ))
        # 描画処理を実行
        self.__pygame.display.update()

        return

    #-------------------------------------------------------------------------------
    # キー入力
    #-------------------------------------------------------------------------------
    def input( self ):

        for event in self.__pygame.event.get():

            # 終了イベント
            if event.type == QUIT:
                self.__finalize()

            # キ－入力イベント
            if event.type == KEYDOWN:
                if event.key == K_ESCAPE:
                    self.__finalize()
                elif event.key == K_RETURN:
                    self.__scene = scn_base.EnumScene.Dungeon

        return
    #-------------------------------------------------------------------------------
    # シーン取得
    #-------------------------------------------------------------------------------
    def get_scene( self ):
        return self.__scene

